// 데이터 변수 저장
const data = [
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인완료", "2024.06.29", "2024.06.29", "교사C"],
    ["휴가신청", "반려", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사B"],
    ["품의서", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["품의서", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인완료", "2024.06.29", "2024.06.29", "교사C"],
    ["휴가신청", "반려", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사B"],
    ["품의서", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["품의서", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인완료", "2024.06.29", "2024.06.29", "교사C"],
    ["휴가신청", "반려", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사B"],
    ["품의서", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["품의서", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인완료", "2024.06.29", "2024.06.29", "교사C"],
    ["휴가신청", "반려", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사B"],
    ["품의서", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["품의서", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인완료", "2024.06.29", "2024.06.29", "교사C"],
    ["휴가신청", "반려", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사B"],
    ["품의서", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["휴가신청", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
    ["품의서", "승인대기", "2024.06.29", "2024.06.29", "교사A"],
];

let grid;

// 선택된 상태별로 필터링하여 노출
function filterData(status) {
    if (status === "전체상태") {
        return data;
    }
    return data.filter(row => row[1] === status);
}

// Function to filter data based on status
function filterData(status) {
    if (status === "전체상태") {
        return data;
    }
    return data.filter(row => row[1] === status);
}

$(document).ready(function() {
    // 그리드 렌더링
    grid = new gridjs.Grid({
        columns: [
            {
                name: "구분",
                formatter: (cell, row) => {
                    return gridjs.html(`<a href="approval/detail" class="text-decoration-none text-reset">${cell}</a>`);
                }
            },
            {
                name: "상태",
                formatter: (cell, row) => {
                    return gridjs.html(`<a href="approval/detail" class="text-decoration-none text-reset">${cell}</a>`);
                }
            },
            {
                name: "등록일자",
                formatter: (cell, row) => {
                    return gridjs.html(`<a href="approval/detail" class="text-decoration-none text-reset">${cell}</a>`);
                }
            },
            {
                name: "갱신일자",
                formatter: (cell, row) => {
                    return gridjs.html(`<a href="approval/detail" class="text-decoration-none text-reset">${cell}</a>`);
                }
            },
            {
                name: "작성자",
                formatter: (cell, row) => {
                    return gridjs.html(`<a href="approval/detail" class="text-decoration-none text-reset">${cell}</a>`);
                }
            }
        ],
        data: filterData("전체상태"),
        pagination: {
            enabled: true,
            limit: 8
        },
        // search: {
        //     enabled: true
        // },
        sort: true,
        resizable: true,
    }).render(document.getElementById("wrapper"));


    // Event listener for status filter
    $("#statusFilter").on("change", function() {
        grid.updateConfig({
            data: filterData($(this).find($('option:selected')).text())
        }).forceRender();
    });
});